begin
  Print($'На каком языке к вам стоит обращаться?{newline}What is your native language?{newline}我应该使用什么语言与您联系?');
  Print($'{newline}ما هي اللغة التي يجب استخدامها للاتصال بك?{newline}באיזו שפה עלי לתקשר איתך?');
  var language := ReadString;
  case language of
    'Английский','English','英语','الإنجليزية','אנגלית': Print('Hello!');
    'Арабский','Arabic','阿拉伯','العربية','ערבית': Print('مرحبًا!');
    'Иврит','Hebrew','希伯来语','العبرية','עברית': Print('שלום!');
    'Китайский','Chinese','中文','الصينية','סיני': Print('你好！');
    'Русский','Russian','俄语','الروسية','שפה רוסית': Print('Здравствуйте!');
  else Print('К сожалению ваш язык не поддерживается или вы допустили ошибку в написании');
  end;
end.